
'''Спросить человека маршрут ("как пройти в библиотеку"). 
Получить ответ в виде строки. Сохранить в переменную. 
Вывести первое слово ответа на экран
Спросить человека размеры поля (х * у), получить их 
ОДНИМ вводом '7x8', "нарисовать" поле буковками о без 
использования цикла.
Нарисовать только границу поля и пустую серединку.
Вывести на экран таблицу из 4 строк: три товара и 
сумма без использования цикла
С помощью только while сделать задачи 2, 3, 4
Получить математический пример с клавиатуры, вычислить'''


task = input('Как пройти в библиотеку ')

task_answ = task.split()

if len(task_answ) < 6:
    task_ask = task_answ[1]
    print('Тебе ответили ', task_ask)
#else: